src/logs/api/test-api-prediction-activities-20250731-142706.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-prediction-activities.ts
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 127 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 281 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 451 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 607 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 754 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 938 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 1084 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 1296 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 1492 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 1639 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......................: 1650    162.794514/s
    checks_succeeded...................: 100.00% 1650 out of 1650
    checks_failed......................: 0.00%   0 out of 1650

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=58.56ms min=17.08ms med=55.35ms max=175.86ms p(90)=76.41ms p(95)=96.98ms
      { expected_response:true }............................................: avg=58.56ms min=17.08ms med=55.35ms max=175.86ms p(90)=76.41ms p(95)=96.98ms
    http_req_failed.........................................................: 0.00%  0 out of 1650
    http_reqs...............................................................: 1650   162.794514/s

    EXECUTION
    iteration_duration......................................................: avg=60.84ms min=22.99ms med=56.18ms max=260.17ms p(90)=80.04ms p(95)=103.1ms
    iterations..............................................................: 1650   162.794514/s
    vus.....................................................................: 10     min=10        max=10
    vus_max.................................................................: 10     min=10        max=10

    NETWORK
    data_received...........................................................: 51 MB  5.1 MB/s
    data_sent...............................................................: 222 kB 22 kB/s



running (10.1s), 00/10 VUs, 1650 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s